[
  {
    "start_year": 1890,
    "end_year": 1910,
    "name": "Nguyễn Sinh Cung / Nguyễn Tất Thành",
    "activity": "Sinh ra tại làng Kim Liên, Nam Đàn, Nghệ An. Học tại Huế, sau đó vào Nam.",
    "location": "Nghệ An, Huế",
    "lat": 18.6792,
    "lon": 105.6819,
    "description": "Thời niên thiếu, học hành và hình thành tư tưởng yêu nước ban đầu."
  },
  {
    "start_year": 1910,
    "end_year": 1911,
    "name": "Chuẩn bị rời Tổ quốc",
    "activity": "Sống tại Sài Gòn, làm việc và chuẩn bị rời nước.",
    "location": "TP. Hồ Chí Minh",
    "lat": 10.7769,
    "lon": 106.7009,
    "description": "Giai đoạn chuẩn bị lên đường tìm đường cứu nước, làm thuê tại Bến Nhà Rồng."
  },
  {
    "start_year": 1911,
    "end_year": 1917,
    "name": "Nguyễn Tất Thành rời Tổ quốc",
    "activity": "Rời Bến Nhà Rồng năm 1911, làm phụ bếp trên tàu, đến nhiều nước châu Âu, châu Phi, châu Mỹ.",
    "location": "TP. Hồ Chí Minh, Marseille, New York, Le Havre, Dakar",
    "lat": 10.7642,
    "lon": 106.7061,
    "description": "Thời kỳ bôn ba khắp năm châu để tìm hiểu con đường cứu nước, tích lũy kinh nghiệm thực tế."
  },
  {
    "start_year": 1917,
    "end_year": 1923,
    "name": "Hoạt động tại Pháp",
    "activity": "Trở lại Pháp sau Thế chiến I, tham gia Đảng Xã hội Pháp, viết báo Le Paria, đấu tranh cho thuộc địa.",
    "location": "Paris",
    "lat": 48.8566,
    "lon": 2.3522,
    "description": "Giai đoạn trưởng thành về chính trị, dấn thân vào phong trào công nhân và phản đế ở Pháp."
  },
  {
    "start_year": 1923,
    "end_year": 1924,
    "name": "Nguyễn Ái Quốc tại Liên Xô",
    "activity": "Tham gia Quốc tế Cộng sản, học tập tại Trường Phương Đông, gặp gỡ lãnh đạo CSQT.",
    "location": "Moskva",
    "lat": 55.7558,
    "lon": 37.6176,
    "description": "Củng cố tư tưởng Mác–Lênin, thiết lập liên hệ quốc tế để giúp cách mạng Việt Nam."
  },
  {
    "start_year": 1924,
    "end_year": 1925,
    "name": "Chuyển tiếp từ Liên Xô sang Trung Quốc",
    "activity": "Hoàn thành công việc tại Quốc tế Cộng sản, sang Quảng Châu.",
    "location": "Moskva, Quảng Châu",
    "lat": 23.1291,
    "lon": 113.2644,
    "description": "Giai đoạn chuẩn bị mở rộng ảnh hưởng cách mạng tại Châu Á."
  },
  {
    "start_year": 1925,
    "end_year": 1927,
    "name": "Thành lập Hội Việt Nam Cách mạng Thanh niên",
    "activity": "Tổ chức hội tại Quảng Châu, đào tạo cán bộ, xuất bản báo Thanh Niên, truyền bá tư tưởng cách mạng.",
    "location": "Quảng Châu",
    "lat": 23.1291,
    "lon": 113.2644,
    "description": "Đặt nền móng cho cách mạng Việt Nam, truyền bá lý luận Mác–Lênin vào trong nước."
  },
  {
    "start_year": 1927,
    "end_year": 1929,
    "name": "Nguyễn Ái Quốc hoạt động tại Xiêm (Thái Lan) và Đông Dương",
    "activity": "Tổ chức cơ sở Việt kiều yêu nước ở Udon Thani, tiếp xúc cách mạng Lào, Campuchia.",
    "location": "Udon Thani, Xiêng Khoảng, Vientiane",
    "lat": 17.4156,
    "lon": 102.7859,
    "description": "Mở rộng ảnh hưởng cách mạng sang các nước Đông Dương, tổ chức phong trào yêu nước Việt kiều."
  },
  {
    "start_year": 1929,
    "end_year": 1930,
    "name": "Tập hợp phong trào, chuẩn bị hội nghị",
    "activity": "Thu thập tình hình phong trào cộng sản ở Việt Nam, chuẩn bị Hội nghị hợp nhất các tổ chức.",
    "location": "Hồng Kông",
    "lat": 22.3193,
    "lon": 114.1694,
    "description": "Giai đoạn hoàn tất những điều kiện cần thiết cho việc thành lập Đảng Cộng sản Việt Nam."
  },
  {
    "start_year": 1930,
    "end_year": 1931,
    "name": "Thành lập Đảng Cộng sản Việt Nam",
    "activity": "Chủ trì hội nghị hợp nhất tại Hồng Kông, thông qua Cương lĩnh đầu tiên.",
    "location": "Hồng Kông (Trung Quốc)",
    "lat": 22.3193,
    "lon": 114.1694,
    "description": "Đặt nền móng cho Đảng Cộng sản Việt Nam, lãnh đạo cách mạng dân tộc."
  },
  {
    "start_year": 1931,
    "end_year": 1933,
    "name": "Nguyễn Ái Quốc bị bắt và hoạt động bí mật",
    "activity": "Bị Anh bắt giam ở Hồng Kông, sau đó được Quốc tế Cộng sản giúp đỡ và hoạt động bí mật.",
    "location": "Hồng Kông, Thượng Hải",
    "lat": 22.3193,
    "lon": 114.1694,
    "description": "Thời kỳ nguy nan nhưng không từ bỏ lý tưởng, kiên định con đường cách mạng."
  },
  {
    "start_year": 1933,
    "end_year": 1934,
    "name": "Thoát hiểm và tiếp tục hoạt động bí mật",
    "activity": "Rời Hồng Kông sang Thượng Hải, tránh sự truy nã, hoạt động kín đáo.",
    "location": "Thượng Hải",
    "lat": 31.2304,
    "lon": 121.4737,
    "description": "Giai đoạn ẩn náu và giữ liên lạc với các tổ chức quốc tế để tiếp tục sự nghiệp cách mạng."
  },
  {
    "start_year": 1934,
    "end_year": 1938,
    "name": "Nguyễn Ái Quốc hoạt động tại Liên Xô và Trung Quốc",
    "activity": "Trở lại Liên Xô, làm việc tại Quốc tế Cộng sản và chuẩn bị kế hoạch trở về Đông Dương.",
    "location": "Moskva, Diên An",
    "lat": 55.7558,
    "lon": 37.6176,
    "description": "Thời kỳ phục hồi hoạt động cách mạng, tiếp tục nghiên cứu và củng cố niềm tin vào đấu tranh dân tộc."
  },
  {
    "start_year": 1938,
    "end_year": 1941,
    "name": "Chuẩn bị về nước",
    "activity": "Hoạt động tại Diên An (Trung Quốc), theo dõi tình hình chiến tranh thế giới và phong trào cách mạng trong nước.",
    "location": "Diên An",
    "lat": 36.5976,
    "lon": 109.4891,
    "description": "Giai đoạn xây dựng lực lượng và chiến lược để trở lại Việt Nam trực tiếp lãnh đạo cách mạng."
  },
  {
    "start_year": 1941,
    "end_year": 1945,
    "name": "Nguyễn Ái Quốc về nước, lãnh đạo cách mạng",
    "activity": "Trở về Pác Bó (Cao Bằng), chủ trì Hội nghị Trung ương 8, thành lập Việt Minh, lãnh đạo Cách mạng Tháng Tám.",
    "location": "Cao Bằng, Hà Nội",
    "lat": 22.6833,
    "lon": 106.1167,
    "description": "Thời kỳ hoạt động trực tiếp trên lãnh thổ Việt Nam để lãnh đạo Tổng khởi nghĩa giành chính quyền."
  },
  {
    "start_year": 1945,
    "end_year": 1946,
    "name": "Hồ Chí Minh lãnh đạo chính phủ cách mạng đầu tiên",
    "activity": "Tuyên ngôn Độc lập ngày 2/9/1945, làm Chủ tịch nước, đàm phán với Pháp, giữ gìn chính quyền non trẻ.",
    "location": "Hà Nội",
    "lat": 21.0285,
    "lon": 105.8542,
    "description": "Xây dựng nền móng nước Việt Nam Dân chủ Cộng hòa, giữ vững chính quyền trước thù trong giặc ngoài."
  },
  {
    "start_year": 1946,
    "end_year": 1954,
    "name": "Hồ Chí Minh trong kháng chiến chống Pháp",
    "activity": "Lãnh đạo kháng chiến 9 năm, xây dựng căn cứ địa Việt Bắc, chỉ đạo chiến dịch Điện Biên Phủ.",
    "location": "Việt Bắc, Hà Nội, Điện Biên",
    "lat": 21.75,
    "lon": 104.9,
    "description": "Lãnh đạo kháng chiến chống thực dân Pháp thắng lợi, kết thúc bằng chiến thắng Điện Biên Phủ."
  },
  {
    "start_year": 1954,
    "end_year": 1964,
    "name": "Xây dựng miền Bắc xã hội chủ nghĩa",
    "activity": "Xây dựng chính quyền, cải cách ruộng đất, phát triển kinh tế, hàn gắn hậu quả chiến tranh.",
    "location": "Hà Nội, Nam Định, Thái Nguyên",
    "lat": 21.0285,
    "lon": 105.8542,
    "description": "Xây dựng hậu phương lớn miền Bắc làm cơ sở cho sự nghiệp thống nhất đất nước."
  },
  {
    "start_year": 1964,
    "end_year": 1965,
    "name": "Chuẩn bị bước vào cao trào chống Mỹ",
    "activity": "Chỉ đạo chiến lược phản công trước khi Mỹ đưa quân vào miền Nam, phát động phong trào thi đua yêu nước.",
    "location": "Hà Nội",
    "lat": 21.0285,
    "lon": 105.8542,
    "description": "Giai đoạn củng cố lực lượng và tinh thần toàn dân trong giai đoạn chuyển tiếp khốc liệt chống Mỹ cứu nước."
  },
  {
    "start_year": 1965,
    "end_year": 1969,
    "name": "Lãnh đạo kháng chiến chống Mỹ",
    "activity": "Kêu gọi toàn dân kháng chiến, viết thư động viên miền Nam, xây dựng mặt trận ngoại giao và tư tưởng.",
    "location": "Hà Nội",
    "lat": 21.0285,
    "lon": 105.8542,
    "description": "Tiếp tục lãnh đạo đất nước trong giai đoạn ác liệt nhất của chiến tranh chống Mỹ cứu nước."
  },
  {
    "start_year": 1969,
    "end_year": 2025,
    "name": "Chủ tịch Hồ Chí Minh yên nghỉ",
    "activity": "Qua đời ngày 2/9/1969. Thi hài được gìn giữ trong Lăng Chủ tịch Hồ Chí Minh tại Ba Đình, Hà Nội.",
    "location": "Hà Nội",
    "lat": 21.0366,
    "lon": 105.8346,
    "description": "Trở thành biểu tượng bất diệt của dân tộc Việt Nam. Nơi an nghỉ trở thành trung tâm tưởng niệm quốc gia."
  }
]